{
    "Title": "Iridiquate",
    "Credits": "Created by Ivy Dudzik.",
    "InitialLocation": "The Beach",
    "Locations": {
        "The Beach": {
            "Body": "You stand on <b>The Beach</b>. <br>Glimmering seas shine to the east and a dense rainforest watches you from the west. <br>The unbroken beach follows the coastline south, while a path of dirt and sand meanders up north, leading to high bluffs. <br>This would be a beautiful place to drive your first bomb into the earth of the island.",
            "Choices": [
                {
                    "Text": "The Rainforest",
                    "Target": "The Rainforest"
                },
                {
                    "Text": "The Cliff",
                    "Target": "The Cliff"
                },
                {
                    "Text": "Plant Explosives",
                    "IsBombPlant": true,
                    "Target": "The Beach",
                    "NewBody": "You stand on <b>The Beach</b>. <br>Glimmering seas shine to the east and a dense rainforest watches you from the west. <br>The unbroken beach follows the coastline south, while a path of dirt and sand meanders up north, leading to high bluffs. <br><b>Your bomb, a silver pillar of dormant incendiary power, sticks out of the sand like a sore thumb.</b>"
                }
            ]
        },
        "The Rainforest": {
            "Body": "You creep through <b>The Rainforest</b>. <br>This forest path connects the turquoise sea on both sides, with the bright beach to the east and a shaded cove down a sharp incline to the west. <br>Similarly, daylight filters through the trees to the north, while the southern reaches of the rainforest are dark.",
            "Choices": [
                {
                    "Text": "The Beach",
                    "Target": "The Beach",
                    "IsBombLocation": true
                },
                {
                    "Text": "The Cove",
                    "Target": "The Cove",
                    "IsBombLocation": true
                },
                {
                    "Text": "The Clearing",
                    "Target": "The Clearing",
                    "IsBombLocation": true
                },
                {
                    "Text": "The Pit",
                    "Target": "The Pit"
                }
            ]
        },
        "The Cove": {
            "Body": "You wade across <b>The Cove</b>. <br>The inclined path you slid down to arrive here cannot be scaled, but luckily there seems to be a shallow reef protecting this side of the island from harsh waves, providing a path to the northwest, around the island. <br>A wide stone plateau, thrust out from the center of the cove, would be the perfect spot to place a warhead.",
            "Choices": [
                {
                    "Text": "The Reef",
                    "Target": "The Reef"
                },
                {
                    "Text": "Plant Explosives",
                    "IsBombPlant": true,
                    "Target": "The Cove",
                    "NewBody": "You wade across <b>The Cove</b>. <br>The inclined path you slid down to arrive here cannot be scaled, but luckily there seems to be a shallow reef protecting this side of the island from harsh waves, providing a path to the northwest, around the island. <br><b>The wide stone plateau in the center of the cove  is now home to a hideous silver statue with one fourth of the destructive power required to level the island.</b>"
                }
            ]
        },
        "The Reef": {
            "Body": "You trudge through <b>The Reef</b>, thick leather boots protecting you from the sharp coral. <br>The only way out of the fragile ecosystem is via a small, muddy beach that leads to a clearing in the rainforest.",
            "Choices": [
                {
                    "Text": "The Clearing",
                    "Target": "The Clearing",
                    "IsBombLocation": true
                }
            ]
        },
        "The Clearing": {
            "Body": "You find a quiet moment in <b>The Clearing</b>. <br> A serene path leads into the rainforest to the south. <br>A vibrant bluebird hops around the soft, fern-covered ground. <br>It would look much better eclipsed by the shadow of a bombshell.",
            "Choices": [
                {
                    "Text": "The Rainforest",
                    "Target": "The Rainforest"
                },
                {
                    "Text": "Plant Explosives",
                    "IsBombPlant": true,
                    "Target": "The Clearing",
                    "NewBody": "You find a quiet moment in <b>The Clearing</b>. <br> A serene path leads into the rainforest to the south. <br><b>A massive explosive, the very vision of death, sits unmoving in the center of the meadow. </b>"
                }
            ]
        },
        "The Cliff": {
            "Body": "You stride along <b>The Cliff</b>. <br>Cool mists roll over the edge and cover this stunning overlook, burning off as they drift towards the sunny beach to the south.  <br>A steep ledge–just low enough to leap from–cuts the cliff off in the west, just ahead of  a clearing in the rainforest below.",
            "Choices": [
                {
                    "Text": "The Beach",
                    "Target": "The Beach",
                    "IsBombLocation": true
                },
                {
                    "Text": "The Clearing",
                    "Target": "The Clearing",
                    "IsBombLocation": true
                }
            ]
        },
        "The Pit": {
            "Body": "You tiptoe around <b>The Pit</b>, a yawning maw that exhales cold breaths out of the dark earth. <br>The ground to the south seems to be steadily rising, while the path north leads back to the rainforest’s heart.",
            "Choices": [
                {
                    "Text": "The Rainforest",
                    "Target": "The Rainforest"
                },
                {
                    "Text": "The Mount",
                    "Target": "The Mount",
                    "IsBombLocation": true
                }
            ]
        },
        "The Mount": {
            "Body": "You bask in the awe of <b>The Mount</b>. <br>This long-dead volcanic corpse is now a huge, flat-topped expanse of black sand that rises out of the southern side of the island.  <br>Two paths are visible down the north side of the mount, one leading into the forest and another steep path leading towards a large rock formation among the palms on the east side of the island. <br>This grand altar would be the perfect place to sacrifice your most magnificent explosive.",
            "Choices": [
                {
                    "Text": "The Pit",
                    "Target": "The Pit"
                },
                {
                    "Text": "The Den",
                    "Target": "The Den"
                },
                {
                    "Text": "Plant Explosives",
                    "IsBombPlant": true,
                    "Target": "The Mount",
                    "NewBody": "You bask in the awe of <b>The Mount</b>. <br>This long-dead volcanic corpse is now a huge, flat-topped expanse of black sand that rises out of the southern side of the island.  <br>Two paths are visible down the north side of the mount, one leading into the forest and another steep path leading towards a large rock formation among the palms on the east side of the island. <br><b>Five tons of pure death reach up from the center of the mount, begging for their imminent detonation.</b>"
                }
            ]
        },
        "The Den": {
            "Body": "You stalk into <b>The Den</b>, a long abandoned bestial abode. <br>Canine fur is caught amongst the sharp edges of the rock walls, and two paths emerge from the darkness of the cave, one leading back into the forest, and one out among the palms.",
            "Choices": [
                {
                    "Text": "The Rainforest",
                    "Target": "The Rainforest"
                },
                {
                    "Text": "The Shed",
                    "Target": "The Shed",
                    "IsKeyLocation": true
                }
            ]
        },
        "The Sea": {
            "Body": "You rise and fall gently in <b>The Sea</b>, your boat keeping you dry. <br>At this distance, the island looks like it was built for fairies… or dolls.  <br>With each of the bombs placed upon on the island, you can detonate the explosives from here.",
            "Choices": [
                {
                    "Text": "The Beach",
                    "Target": "The Beach",
                    "IsBombLocation": true
                },
                {
                    "Text": "Detonate Explosives",
                    "IsBombDetonation": true,
                    "Target": "The Sea",
                    "NewBody": "You are captivated by the death throes of <b>The Island</b>. <br><b>Massive waves emanate from the explosion, grabbing vicious hold of your boat. <br>Hellfire rains from the sky, obscuring the sun with ash. <br>You know, in your heart: <i>it was worth it.</i><b>"
                }
            ]
        },
        "The Shed": {
            "Body": "You marvel at <b>The Shed</b>, the only sign of sapient intervention on the island. <br>It has been constructed out of palm wood and tightly woven plant fibers, maybe 1 year ago or maybe 100.  <br>The shed houses a single row boat in perfect condition.",
            "Choices": [
                {
                    "Text": "The Beach",
                    "Target": "The Beach",
                    "IsBombLocation": true
                },
                {
                    "Text": "Collect Boat",
                    "IsCollectBoat": true,
                    "Target": "The Shed",
                    "Door": "The Beach",
                    "NewBody": "You marvel at <b>The Shed</b>, the only sign of sapient intervention on the island. <br>It has been constructed out of palm wood and tightly woven plant fibers, maybe 1 year ago or maybe 100.  <br><b>The shed once housed a row boat, until you dragged it off to the beach.</b>",
                    "AdditionalDoorBody": " <br>Your boat waits at the surf's edge.",
                    "AdditionalDoorChoice": {
                        "Text": "The Sea",
                        "Target": "The Sea",
                        "IsDetonationLocation": true
                    }
                }
            ]
        }
    }
}